# IsLBReadOnly

## Description
Determines the list browser's read-only state.

```pascal
FUNCTION IsLBReadOnly(
				dialogID    : LONGINT;
				componentID : LONGINT): BOOLEAN;
```

```python
def vs.IsLBReadOnly(dialogID, componentID):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|   |
|componentID|LONGINT|   |

## Version
Availability: from Vectorworks 2022

## Category
* Dialogs - Modern - Browser